MACHINE_LIST = [
    'A07','A08','A09','A10','A11','A12',
    'B14','B15','B16','B17','B18','B19','B20','B21','B22','B23','B24',
    'C25','C26','C27','C29','C30'
]

MACHINE_CONFIG = {
  "A07": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","邊框毛邊(會掉)+撞傷+油漬+腐蝕凸起/模痕","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)","功能區焦痕","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","功能區縮水","字碼與圖紙不符","中央方框缺料+凹痕"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2639"]
  },
  "A08": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","邊框毛邊(會掉)+撞傷+油漬+腐蝕凸起/模痕","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)","功能區焦痕","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","功能區縮水","字碼與圖紙不符"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2639"]
  },
  "A09": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","邊框毛邊(會掉)+撞傷+油漬+腐蝕凸起/模痕","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)","功能區焦痕","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","功能區縮水","字碼與圖紙不符"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "A10": {
    "visual": ["功能區明顯瓦斯氣痕+結合線+功能區縮水","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","牙台成型不良","功能區縮水","注膠孔斷點不平整+異常+異物+破皮","週期偏移/Datecode 月份章偏移"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","CEL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "A11": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","裂痕+破裂+刮痕+Particle","功能區拉模造成毛邊","多處牙台凸起 TPSX Control:7.18~7.32mm","多處牙台凸起 TPSY Control:7.18~7.32mm","字碼缺料","中央方框缺料+凹痕"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "A12": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","邊框毛邊(會掉)+撞傷+油漬+腐蝕凸起/模痕","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)","功能區焦痕","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","功能區縮水","字碼與圖紙不符"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "B14": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)","牙台成型不良","功能區縮水"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "B15": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","功能區拉模造成毛邊","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "B16": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕","孔內毛邊(會掉)+孔塞","功能區焦痕","異物","邊框凸起","邊框毛邊(會掉)+邊框異常"],
    "eol": ["檢查絲印的位置（左側）","檢查絲印的狀態（清晰度/破損/暈染）","標籤10位數確認(隨機抽樣)","標籤清潔/條碼測試","SR","WARPAGE"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2639"]
  },
  "B17": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕","孔內毛邊(會掉)+孔塞","功能區焦痕","異物","邊框凸起","邊框毛邊(會掉)+邊框異常"],
    "eol": ["檢查絲印的位置（左側）","檢查絲印的狀態（清晰度/破損/暈染）","標籤10位數確認(隨機抽樣)","標籤清潔/條碼測試","SR","WARPAGE"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2639"]
  },
  "B18": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","邊框毛邊(會掉)+撞傷+油漬+腐蝕凸起/模痕","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)","功能區焦痕","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","功能區縮水","字碼與圖紙不符"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "B19": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","孔內毛邊(會掉)+孔塞","功能區焦痕","異物","多處功能區底部模痕","牙台頂部凹痕+功能區斜面凹痕","邊框毛邊(會掉)+邊框異常"],
    "eol": ["檢查絲印的位置（左側）","檢查絲印的狀態（清晰度/破損/暈染）","標籤10位數確認(隨機抽樣)","標籤清潔/條碼測試","SR","WARPAGE"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2639"]
  },
  "B20": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","孔內毛邊(會掉)+孔塞","功能區焦痕","異物","多處功能區底部模痕","背面牙台頂部凹痕+(2,4)牙台頂部凸起","邊框毛邊(會掉)+邊框異常","(2,4)(2,5)功能區凸起 BPSY Control:10.24~10.38mm"],
    "eol": ["檢查絲印的位置（左側）","檢查絲印的狀態（清晰度/破損/暈染）","標籤10位數確認(隨機抽樣)","標籤清潔/條碼測試","SR","WARPAGE"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2638"]
  },
  "B21": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","功能區拉模造成毛邊","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","功能區縮水","牙台易橢圓","牙台腐蝕凸起TPSX(16,1)(16,13) control:7.19~7.33mm","牙台腐蝕凸起TPSX(20,10)(21,10) control:7.19~7.33mm","耳朵字碼模糊"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "B22": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","牙不滿","邊框毛邊(會掉)+邊框異常","裂痕"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2639"]
  },
  "B23": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","孔內毛邊(會掉)+孔塞","功能區焦痕","異物","邊框凸起","邊框毛邊(會掉)+邊框異常"],
    "eol": ["檢查絲印的位置（左側）","檢查絲印的狀態（清晰度/破損/暈染）","標籤10位數確認(隨機抽樣)","標籤清潔/條碼測試","SR","WARPAGE"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2639"]
  },
  "B24": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","功能區拉模造成毛邊","嚴重牙不滿","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","功能區油漬","注膠孔口附近口袋尺寸 Control:18.49~18.70mm","功能區拉模造成毛邊"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "C25": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","功能區拉模造成毛邊","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH 40Pcs","SKH 20Pcs"]
  },
  "C26": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","功能區拉模造成毛邊","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "C27": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","邊框毛邊(會掉)+撞傷+油漬+腐蝕凸起/模痕","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)","功能區焦痕","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","功能區縮水","多處功能區底部凸起TPSX,Y control:3.11~3.19mm","牙台成型不良"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "C29": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","邊框毛邊(會掉)+撞傷+油漬+腐蝕凸起/模痕","注膠孔斷點不平整+毛邊/周圍碎屑(會掉)","功能區焦痕","孔內毛邊/孔內\"虛\"毛邊(會掉)+孔塞","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","背面牙台成型不良"],
    "eol": ["SR","WARPAGE","功能區撞傷/刮痕/破裂/裂痕/油漬/毛邊"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH"]
  },
  "C30": {
    "visual": ["功能區明顯瓦斯氣痕+結合線","正背面功能區+牙台缺料+卡料屑+燒焦+卡殘膠+撞傷","頂針毛邊(會掉)+油漬/污漬+腐蝕+頂針撞傷造成碎屑","孔內毛邊(會掉)+孔塞","功能區焦痕","注膠孔斷點不平整+異常+異物+破皮","邊框凸起","邊框毛邊(會掉)+邊框異常"],
    "eol": ["檢查絲印的位置（左側）","檢查絲印的狀態（清晰度/破損/暈染）","標籤10位數確認(隨機抽樣)","標籤清潔/條碼測試","SR","WARPAGE"],
    "dims": ["OL (Before Annealing)","OL (After Annealing)","OW","EL","ST","WARPAGE","C/C","SR Test","SR Value","WEIGHT","SKH","SKH 2639"]
  }
}
